# Imorting pandas

In [1]:
import pandas as pd
import numpy as np

# Pandas Series

# Creating pandas series

In [7]:
L=[12,22,23,34]
my_series=pd.Series(L,index=["a","b","c","d"])
my_series

a    12
b    22
c    23
d    34
dtype: int64

In [8]:
my_series["a"]

12

# Accessing values inside pandas series

In [10]:
my_series["b"]

22

# Pandas Data Frames

# Creating pandas data frames

# (01) Using dictionaries

In [13]:
d={"Name":["Sam","Jane","Kane"],"Age":[23,33,25]}
df=pd.DataFrame(d)
df

   Name  Age
0   Sam   23
1  Jane   33
2  Kane   25

# (02) Using numpy arrays

In [14]:
arr=np.array([[12,22],[33,44],[16,34]])
arr

array([[12, 22],
       [33, 44],
       [16, 34]])

In [16]:
df=pd.DataFrame(arr,columns=["col1","Col2"])
df

   col1  Col2
0    12    22
1    33    44
2    16    34

# (03) Using pandas series

In [17]:
my_series=pd.Series([1,2,3,4,7],index=["a","b","c","d","e"])
my_series

a    1
b    2
c    3
d    4
e    7
dtype: int64

In [18]:
type(my_series)

pandas.core.series.Series

In [19]:
df=my_series.to_frame()
df.columns=["Col1"]
df

   Col1
a     1
b     2
c     3
d     4
e     7

In [20]:
my_series1=pd.Series([1,2,3,4,7],index=["a","b","c","d","e"])
my_series2=pd.Series([6,5,7,8,2],index=["a","b","c","d","e"])

In [21]:
my_series1

a    1
b    2
c    3
d    4
e    7
dtype: int64

In [22]:
my_series2

a    6
b    5
c    7
d    8
e    2
dtype: int64

In [23]:
df_new=pd.concat([my_series1,my_series2],axis=1)
df_new.columns=["First Column","Second Column"]
df_new

   First Column  Second Column
a             1              6
b             2              5
c             3              7
d             4              8
e             7              2

# (04) Creating data frames using CSV files

In [24]:
df=pd.read_csv("D:\L4S1\Project\Data -course\Day 3\iris.csv")
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [25]:
type(df)

pandas.core.frame.DataFrame

# Top values of the data set

In [26]:
df.head()

#first 5 rows pennanawa

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [27]:
df.head(10)

#rows 10k pennanwa

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

# Bottom values of the data set

In [28]:
df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

# Columns & indexes of the data set

In [30]:
df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=150, step=1)

# Shape of the data frame

In [32]:
df.shape

(150, 5)

In [33]:
df.shape[0]

150

In [34]:
df.shape[1]

5

# (05) Creating data frames using Excel files

In [36]:
df_excel=pd.read_excel("D:\L4S1\Project\Data -course\Day 3\iris.XLSX")
df_excel

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [40]:
#sheet keepyak tibboth excel eke

df_excel=pd.ExcelFile("D:\L4S1\Project\Data -course\Day 3\iris.XLSX")
df_excel.sheet_names

['iris', 'marks']

In [41]:
df_excel.parse(df_excel.sheet_names[0])

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [42]:
df_excel.parse(df_excel.sheet_names[1])

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

# Adding new columns

In [43]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [44]:
df["Col1"]

0    12
1    22
2    23
3    34
4    45
Name: Col1, dtype: int64

In [46]:
df["Col4"]=[34,44,45,56,34]
df

   Col1  Col2  Col3  Col4
0    12    45    56    34
1    22    43    43    44
2    23    44    46    45
3    34    46    67    56
4    45    54    65    34

# Accessing columns & elements

In [47]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

# Accessing columns

In [48]:
df["Col1"]

0    12
1    22
2    23
3    34
4    45
Name: Col1, dtype: int64

In [49]:
type(df)

pandas.core.frame.DataFrame

In [51]:
df[["Col1","Col2"]]

   Col1  Col2
0    12    45
1    22    43
2    23    44
3    34    46
4    45    54

# Accessing elements

In [52]:
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [53]:
df.iloc[0,2]

#location based indexing

56

In [54]:
df.iat[0,2]

56

In [55]:
df.loc[0,"Col3"]

56

In [57]:
df.at[0,"Col3"]

56

# Basic column operations

In [ ]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

# Pandas data frames with apply function

In [58]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [ ]:
df["Col_New"]=df["Col1"]

# Pandas data frames with lambda & map function

In [ ]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

# Selecting rows that have certain values

# Boolean masking technique

In [ ]:
df=pd.DataFrame({"Name":["A","B","C","D","E","F"],"Age":[23,33,21,35,23,34],"Result":["Pass","Fail","Pass","Pass","Fail","Fail"]})
df

# Selecting with lambda with map function

# Data summaries

In [ ]:
data=np.random.random(10).reshape(5,2)
data

In [ ]:
df=pd.DataFrame(data,columns=["A","B"],index=["a","b","c","d","e"])
df

# Summaries for each column

# Summaries for each row

# Finding sums for columns and rows separately

# Finding cumulative sums for columns and rows separately

# Finding means for columns and rows separately

# Finding minumum and maximum for columns and rows separately

# Dropping rows & columns

In [ ]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

# Dropping rows

# Dropping columns

In [ ]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

# Sorting data frames with column values

In [ ]:
d={"Name":["Sam","Jane","Kane"],"Mark1":[67,54,44],"Mark2":[56,56,67],"Mark3":[78,89,76]}
df=pd.DataFrame(d)
df

# Grouping data frames with categorical data

In [ ]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

# Summaries for other variables with grouping

# Summarizing other variables with grouping by using multiple options

# Grouping with more than one columns

In [ ]:
d={"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90],"University":["UOC","UOC","UOC","UOP","UOP"]}
df=pd.DataFrame(d)
df

# Concatenating data frames

In [ ]:
df1=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df2=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])

In [ ]:
df1

In [ ]:
df2

# Concatenating along the rows

# Concatenating along the columns

# Merging data frames

In [ ]:
df1=pd.DataFrame({"ID":[1,2,3,4],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID":[3,4,5,6],"Val2":[56,32,67,65]})

In [ ]:
df1

In [ ]:
df2

# Focus on the common Ids

# Focus on the all Ids

# Focus on the left side data frame Ids

# Focus on the right side data frame Ids

# Using an indicator for showing how the tables are merged

# Merging based on more than one column

In [ ]:
df1=pd.DataFrame({"ID1":[1,2,3,4],"ID2":[7,8,9,10],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID1":[2,3,5,6],"ID2":[8,9,10,11],"Val2":[56,32,67,65]})

In [ ]:
df1

In [ ]:
df2

# Counting values

In [ ]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

# Unique values in a column

In [ ]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

# Replace values in data frame

In [ ]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":[3,6,8]}
df=pd.DataFrame(d)
df

# Stacking & Unstacking data frames

In [ ]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":[3,6,8]}
df=pd.DataFrame(d)
df

# Creating Pivot tables

In [ ]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Rank":["1","2","1","2","1","2","1","2"],"Val":[4,5,6,8,3,9,8,2]}
df=pd.DataFrame(d)
df

# Binning

In [ ]:
d={"ID":[1001,1002,1003,1004,1005],"Marks":[78,88,45,67,59]}
df=pd.DataFrame(d)
df

Using binning

In [ ]:
d={"ID":[1001,1002,1003,1004,1005],"Marks":[78,88,45,67,59]}
df=pd.DataFrame(d)
df

# Working with indexes & columns

In [ ]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

# Columns of the data frame

# Indexes of the data frame

# Changing the order of the rows

# Changing the order of the columns

# Renaming the indexes & columns

# Making indexes as a column

# Permutation & taking samples

In [ ]:
d={"A":np.arange(1,11),"B":np.random.random(10),"C":np.random.randn(10)}
df=pd.DataFrame(d)
df

# Method 01 - Taking a shuffled data frame

# Shuffling data

# Random sample

# Method 02 - Shuffling existing indexes

# Method 03 - Sample method

# Random sample

# Shuffling data frame